I).Loading Dataset :

In [ ]:
import pandas as pd 
# create a Dataframe 
df = pd.read_csv("../data/house_usa.csv", index_col=[0])

#### II). display features

In [48]:
df.keys()

Index(['Avg. Area Income', 'Avg. Area House Age', 'Avg. Area Number of Rooms',
       'Avg. Area Number of Bedrooms', 'Area Population', 'Price',
       'House_Add'],
      dtype='object')

In [49]:
df.columns

Index(['Avg. Area Income', 'Avg. Area House Age', 'Avg. Area Number of Rooms',
       'Avg. Area Number of Bedrooms', 'Area Population', 'Price',
       'House_Add'],
      dtype='object')

#### III).dispay dataframe

In [50]:
df.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,House_Add
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Avg. Area Income              5000 non-null   float64
 1   Avg. Area House Age           5000 non-null   float64
 2   Avg. Area Number of Rooms     5000 non-null   float64
 3   Avg. Area Number of Bedrooms  5000 non-null   float64
 4   Area Population               5000 non-null   float64
 5   Price                         5000 non-null   float64
 6   House_Add                     5000 non-null   object
dtypes: float64(6), object(1)
memory usage: 312.5+ KB

#### IV). Dataframe  index

In [52]:
# actual index
df.index

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       4990, 4991, 4992, 4993, 4994, 4995, 4996, 4997, 4998, 4999],
      dtype='int64', length=5000)

In [53]:
# Create a new index
df.set_index('House_Add', inplace=True)

In [54]:
df.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
House_Add,,,,,,
"208 Michael Ferry Apt. 674\nLaurabury, NE 37010-5101",79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06
"188 Johnson Views Suite 079\nLake Kathleen, CA 48958",79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06
"9127 Elizabeth Stravenue\nDanieltown, WI 06482-3489",61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06
USS Barnett\nFPO AP 44820,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06
USNS Raymond\nFPO AE 09386,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05

In [68]:
df.House_Add.sample(4)

548           60818 Buckley Curve\nSouth Walter, MT 25854
2279    112 Jennifer Locks Suite 881\nWest Mark, VA 43...
2952     8031 Pennington Mission\nPort Nicholas, MA 07353
1218    93861 David Village Apt. 086\nNorth Richardshi...
Name: House_Add, dtype: object

In [69]:
df.keys()

Index(['House_Add', 'Avg. Area Income', 'Avg. Area House Age',
       'Avg. Area Number of Rooms', 'Avg. Area Number of Bedrooms',
       'Area Population', 'Price'],
      dtype='object')

In [70]:
df[['Avg. Area Number of Rooms', 'Avg. Area Number of Bedrooms']].sample(4)

      Avg. Area Number of Rooms  Avg. Area Number of Bedrooms
3878                   7.661429                          3.21
2626                   7.085072                          5.48
966                    5.945900                          3.18
191                    6.194794                          2.15

In [71]:
# display only categorical features 
df.select_dtypes(include="object").sample(4)

                                              House_Add
2032         559 Tammy Knolls\nPort Gary, WY 40773-0532
1307  4725 Briana Hill Suite 003\nWest Ashley, CO 79...
4794     38462 Cox Field Suite 850\nLake Mark, GU 84861
4937  793 Solomon Trail\nNorth Caseyhaven, PW 83256-...

In [72]:
# display only numerical  features 
df.select_dtypes(include="number").sample(4)

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
3276,67645.167188,6.537962,8.803604,5.18,40734.060523,1.603201e+06
1391,73023.325610,5.691798,8.156580,5.00,40512.893267,1.597330e+06
278,85313.885451,6.033158,6.633758,4.21,23974.435568,1.540418e+06
1203,75869.235114,5.932775,7.635630,5.22,32436.286343,1.321389e+06

In [74]:
# displays only numerical features columns 
print( f" Numerical features : {df.select_dtypes(include="number").columns}")

 Numerical features : Index(['Avg. Area Income', 'Avg. Area House Age', 'Avg. Area Number of Rooms',
       'Avg. Area Number of Bedrooms', 'Area Population', 'Price'],
      dtype='object')

In [75]:
# displays only numerical features columns 
print( f" Numerical features : {df.select_dtypes(exclude="number").columns}")

 Numerical features : Index(['House_Add'], dtype='object')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   House_Add                     5000 non-null   object
 1   Avg. Area Income              5000 non-null   float64
 2   Avg. Area House Age           5000 non-null   float64
 3   Avg. Area Number of Rooms     5000 non-null   float64
 4   Avg. Area Number of Bedrooms  5000 non-null   float64
 5   Area Population               5000 non-null   float64
 6   Price                         5000 non-null   float64
dtypes: float64(6), object(1)
memory usage: 273.6+ KB

In [ ]:
# transform  object to categorical type 
# for a better Memory Efficiency a&  Optimized Operations
df['House_Add'] = df['House_Add'].astype('category')

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   House_Add                     5000 non-null   category
 1   Avg. Area Income              5000 non-null   float64
 2   Avg. Area House Age           5000 non-null   float64
 3   Avg. Area Number of Rooms     5000 non-null   float64
 4   Avg. Area Number of Bedrooms  5000 non-null   float64
 5   Area Population               5000 non-null   float64
 6   Price                         5000 non-null   float64
dtypes: category(1), float64(6)
memory usage: 412.4 KB

In [79]:
# reset the index
df.reset_index(inplace=True)

In [80]:
df.head()

,index,House_Add,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
0,0,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701...",79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06
1,1,"188 Johnson Views Suite 079\nLake Kathleen, CA...",79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06
2,2,"9127 Elizabeth Stravenue\nDanieltown, WI 06482...",61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06
3,3,USS Barnett\nFPO AP 44820,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06
4,4,USNS Raymond\nFPO AE 09386,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05

#### V) . diaplay a set of features

In [81]:
df.iloc[0:5,1:4]

,House_Add,Avg. Area Income,Avg. Area House Age
0,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701...",79545.458574,5.682861
1,"188 Johnson Views Suite 079\nLake Kathleen, CA...",79248.642455,6.002900
2,"9127 Elizabeth Stravenue\nDanieltown, WI 06482...",61287.067179,5.865890
3,USS Barnett\nFPO AP 44820,63345.240046,7.188236
4,USNS Raymond\nFPO AE 09386,59982.197226,5.040555

In [82]:
# select only numerical features 
df.select_dtypes(include='number').columns

Index(['index', 'Avg. Area Income', 'Avg. Area House Age',
       'Avg. Area Number of Rooms', 'Avg. Area Number of Bedrooms',
       'Area Population', 'Price'],
      dtype='object')

In [83]:
df.loc[0:10,['Avg. Area Number of Bedrooms', 'Area Population', 'Price']]

    Avg. Area Number of Bedrooms  Area Population         Price
0                           4.09     23086.800503  1.059034e+06
1                           3.09     40173.072174  1.505891e+06
2                           5.13     36882.159400  1.058988e+06
3                           3.26     34310.242831  1.260617e+06
4                           4.23     26354.109472  6.309435e+05
5                           4.04     26748.428425  1.068138e+06
6                           3.41     60828.249085  1.502056e+06
7                           2.42     36516.358972  1.573937e+06
8                           2.30     29387.396003  7.988695e+05
9                           6.10     40149.965749  1.545155e+06
10                          4.10     47224.359840  1.707046e+06

#### VI) . Assign a datAframe to a variable

In [84]:
df.keys()

Index(['index', 'House_Add', 'Avg. Area Income', 'Avg. Area House Age',
       'Avg. Area Number of Rooms', 'Avg. Area Number of Bedrooms',
       'Area Population', 'Price'],
      dtype='object')

In [85]:
X = df.drop('Price', axis=1)
X.sample(5)

,index,House_Add,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population
3376,3376,"50557 Tara Junctions Apt. 377\nPort Rebecca, G...",78069.223973,4.903230,6.885404,4.47,23560.522778
4185,4185,"8048 Fischer Forges Apt. 435\nAprilmouth, AS 7...",73345.673187,5.308315,7.879734,6.44,46245.415567
3004,3004,USS Mason\nFPO AA 65492-7228,86084.335231,6.143843,6.776068,4.33,24447.106696
476,476,"125 Jesse Spring\nNew Benjaminberg, NY 16741",84439.855749,4.313978,7.698765,4.48,19835.247317
1638,1638,"006 Matthew Cliff\nCarlosfort, VA 53572",71595.177283,6.628834,8.050036,5.26,37271.156025

#### VII) . display Dataframe dimension

In [86]:
df.shape

(5000, 8)

In [ ]:
#  n Umber of rows 
f" dataset rows :  {df.shape[0]}"

' dataset rows :  5000'

In [89]:
#  n Umber of columns 
f" dataset Columns :  {df.shape[1]}"

' dataset Columns :  8'